app/Controllers/Sesion.php

SELECT *
FROM `usuarios`
WHERE `email` = 'enzorios321.er@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $usuarioModel = new UsuarioModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $usuario = $usuarioModel->where('email', $email)->first();

SELECT *
FROM `usuarios`
WHERE `email` = 'adsfasdf@gmail'
 LIMIT 1
INSERT INTO `usuarios` (`nombre`, `email`, `password`) VALUES ('dfg', 'adsfasdf@gmail', '$2y$10$/Pbd7uvqaw.YFPvSj3AOE.3//FX3O/YuJjI97edvXrjj3M0K8nN0G')
---
    public function registro()
    {
        $usuarioModel = new UsuarioModel();
        $nombre = $this->request->getPost('nombre');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        // Verifica si el email ya existe
        if ($usuarioModel->where('email', $email)->first()) {
            return redirect()->back()->with('error', 'El email ya está registrado');
        }
        $usuarioModel->insert([
            'nombre' => $nombre,
            'email' => $email,
            'password' => password_hash($password, PASSWORD_DEFAULT)
        ]);