app/Controllers/UsuarioCrud.php

    public function index()
    {
        if ($redirect = $this->checkAuth()) return $redirect;
        $usuarioModel = new UsuarioModel();
        $usuarios = $usuarioModel->findAll();
---
SELECT *
FROM `usuarios`